<details class="bg-slate-300 rounded ">

    <slot></slot>

    <summary>نص محسَّن</summary>

    <br>

    <p>مثال للتجربة:</p>
    <p>اَلْلَّهُ. صلى الله عليه وسلم. بَوَّابَةٌ إِلَى عَاْلَمِيْنَ - بِدُوْنِ مَيْنٍ - {"{"}لِمَنْ كَاْنَ{"}"} فَتَحَ بَاْباً مِنَ "السَّمَاْءِ" . اِسْمُهُ : « الكُوْ » ، ( وَالفُوْ )</p>

    <br>

    <p>حاليا، فيه التعديلات الآتية:</p>
    <ol class="text-right p-lg list-decimal list-inside">
        <br>
        رمز التسبيح والدعاء:
        <li>حذف التشكيل الزائد ـ يعني ليس الإعراب ـ من اسم الجلالة (اَلْلَّه) إلى (الله) - لكي لا يؤثر في الخط</li>
        <li>تحويل التسبيح (عز وجل) ـ بغض النظر عن تشكيله ـ إلى رمزه (۵)، حسب الخط «أضواء السلف»</li>
        <li>تحويل التسبيح (جل جلاله) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﷻ)</li>
        <li>تحويل الدعاء (صلى الله عليه وسلم) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﷺ)</li>
        <li>تحويل الدعاء (عليه السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڠ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (عليها السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﮋ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (عليهما السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڽ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (عليهم السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ۏ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (رضي الله عنه) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﭬ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (رضي الله عنها) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڤ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (رضي الله عنهما) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﭭ)، حسب الخط «أضواء السلف»</li>
        <li>تحويل الدعاء (رضي الله عنهم) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﭫ)، حسب الخط «أضواء السلف»</li>

        <br>
        تصحيح التشكيل والترقيم:
        <li>نقل تنوين فتحة من الألف إلى قبلها: (باباً) إلى (بابًا)</li>
        <li>حذف الفتحة قبل تاء مربوطة: (قطَة) إلى (قطة)</li>
        <li>حذف الألف قبل ألف مد: (بَاب) إلى (باب)</li>
        <li>حذف سكون الألف المدية: (باْبٌ) إلى (بابٌ)</li>
        <li>حذف سكون الواو المدية: (طُوْل) إلى (طُول)</li>
        <li>حذف سكون الياء المدية: (قِيْل) إلى (قِيل)</li>
        <li>نقل الشدة قبل الحركة على نفس الحرف</li>
        <li>حذف المسافة الزائدة قبل علامات الترقيم (، ؛ : .)</li>
        <li>حذف المسافة في أول وآخر القوس والتنصيص: (« باب ») إلى («باب»)</li>
        <li>تحويل القوس المعوج إلى قوس قرآني: ({"{"}{"}"}) إلى (﴿﴾)</li>
        <li>تحويل التنصيص الإنجليزي إلى العربي: (باب "باب".) إلى (باب «باب».)</li>
        <li>تحويل القوس العادي إلى قوسين التنصيص: (باب (باب).) إلى (باب «باب».) </li>
        <li>
            تحويل الشرطة إلى الكشيدة: (باب - باب - باب) إلى (باب ـ باب ـ باب)
        </li>
<br>
        اقتراحات للمستقبل إن شاء الله:
        <li>تشكيل مطلوب لكلمات متكررة سوى حركة الإعراب، أو لجامدات</li>
        حذف الحركات (فِيْ)
        <li>تحويل الأدعية إلى الرموز</li>
        <li>آلية اختيار التعديلات المطلوبة فقط</li>
    </ol>

</details>

<style>
    p, li {
        font-size: larger
    }
</style>
