export default function tahsin(inputText) {

    if (inputText) {
        let processedText = inputText

        
            //// GENERAL INFO
            // template: .replace(//g, '')
            // ignoring tashkil with an optional group that matches any one or more of the tashkil: ([ًٌٍَُِّْ]+)?

            //// CLEANING SPACES AND TASHKIL
            // <li>حذف التشكيل الزائد ـ يعني ليس الإعراب ـ من اسم الجلالة (اَلْلَّه) إلى (الله) - لكي لا يؤثر في الخط</li>
            .replace(/ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ه/g, 'الله')

            // <li>حذف الفتحة قبل تاء مربوطة: (قطَة) إلى (قطة)</li>
            .replace(/اً/g, 'ًا')

            // <li>حذف الألف قبل ألف مد: (بَاب) إلى (باب)</li>
            .replace(/َا/g, 'ا')
            // <li>نقل تنوين فتحة من الألف إلى قبلها: (باباً) إلى (بابًا)</li>
            .replace(/َة/g, 'ة')

            // <li>حذف سكون الألف المدية: (باْبٌ) إلى (بابٌ)</li>
            .replace(/اْ/g, 'ا')
            // <li>حذف سكون الواو المدية: (طُوْل) إلى (طُول)</li>
            .replace(/ُوْ/g, 'ُو')
            // <li>حذف سكون الياء المدية: (قِيْل) إلى (قِيل)</li>
            .replace(/ِيْ/g, 'ِي')

            // <li>نقل الشدة قبل الحركة على نفس الحرف</li>
            .replace(/ُّ/g, 'ُّ')
            .replace(/َّ/g, 'َّ')
            .replace(/ِّ/g, 'ِّ')

            // <li>حذف المسافة الزائدة قبل علىمات الترقيم (، ؛ : .)</li>
            .replace(/ ،/g, '،')
            .replace(/ ؛/g, '؛')
            .replace(/ :/g, ':')
            .replace(/ \. /g, '. ')

            // <li>حذف المسافة في أول وآخر القوس والتنصيص: (« باب ») إلى («باب»)</li>
            .replace(/\( /g, '(')
            .replace(/ \)/g, ')')
            .replace(/« /g, '«')
            .replace(/ »/g, '»')

            //// CONVERTING SYMBOLS
            // <li>تحويل القوس المعوج إلى قوس قرآني: ({'{'}{'}'}) إلى (﴿﴾)</li>
            .replace(/{/g, '﴿')
            .replace(/}/g, '﴾')

            // <li>تحويل الشرطة إلى الكشيدة: (باب - باب - باب) إلى (باب ـ باب ـ باب)</li>
            .replace(/ - /g, ' ـ ')

            // <li>تحويل التنصيص الإنجليزي إلى العربي: (باب "باب".) إلى (باب «باب».)</li>
            .replace(/ "/g, ' «')
            .replace(/" /g, '» ')
            .replace(/"./g, '».')
            .replace(/"،/g, '»،')
            .replace(/"؛/g, '»؛')
            .replace(/":/g, '»:')

            // <li>تحويل القوس العادي إلى قوسين التنصيص: (باب ((باب)).) إلى (باب «باب».) </li>
            .replace(/\))/g, '»')
            .replace(/\(\(/g, '«')

            //// DUA & HONORIFICS
            // <li>تحويل التسبيح (جل جلاله) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﷻ)</li>
            .replace(/ج([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)? ج([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?/g, 'ﷻ')

            // <li>تحويل التسبيح (عز وجل) ـ بغض النظر عن تشكيله ـ إلى رمزه (۵)، حسب الخط «أضواء</li>
            .replace(/ع([ًٌٍَُِّْ]+)?ز([ًٌٍَُِّْ]+)? و([ًٌٍَُِّْ]+)?ج([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?/g, '۵')

            // <li>تحويل الدعاء (صلى الله عليه وسلم) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﷺ)، حسب الخط «أضواء السلف»</li>
            .replace(/ص([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ى([ًٌٍَُِّْ]+)? الله([ًٌٍَُِّْ]+)? ع([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? و([ًٌٍَُِّْ]+)?س([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?/g, 'ﷺ')

            // <li>تحويل الدعاء (عليه السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڠ)، حسب الخط «أضواء السلف»</li>
            .replace(/ع([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?س([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?/g, 'ڠ')

            // <li>تحويل الدعاء (عليها السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﮋ)، حسب الخط «أضواء السلف»</li>
            .replace(/ع([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?س([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?/g, 'ﮋ')

            // <li>تحويل الدعاء (عليهما السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڽ)، حسب الخط «أضواء السلف»</li>
            .replace(/ع([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?س([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?/g, 'ڽ')

            // <li>تحويل الدعاء (عليهم السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ۏ)، حسب الخط «أضواء السلف»</li>
            .replace(/ع([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?س([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?/g, 'ۏ')

            // <li>تحويل الدعاء (رضي الله عنه) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﭬ)، حسب الخط «أضواء السلف»</li>
            .replace(/ر([ًٌٍَُِّْ]+)?ض([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? ع([ًٌٍَُِّْ]+)?ن([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? /g, 'ﭬ')
            // NOTE: This one must have a space at the end, so it doesn't change eg. عنهن 
            // The rest of the dua below are specific enough to prevent collisions like this one

            // <li>تحويل الدعاء (رضي الله عنها) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڤ)، حسب الخط «أضواء السلف»</li>
            .replace(/ر([ًٌٍَُِّْ]+)?ض([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? ع([ًٌٍَُِّْ]+)?ن([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?/g, 'ڤ')

            // <li>تحويل الدعاء (رضي الله عنهما) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﭭ)، حسب الخط «أضواء السلف»</li>
            .replace(/ر([ًٌٍَُِّْ]+)?ض([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? ع([ًٌٍَُِّْ]+)?ن([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?ا([ًٌٍَُِّْ]+)?/g, 'ﭭ')

            // <li>تحويل الدعاء (رضي الله عنهم) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﭫ)، حسب الخط «أضواء السلف»</li>
            .replace(/ر([ًٌٍَُِّْ]+)?ض([ًٌٍَُِّْ]+)?ي([ًٌٍَُِّْ]+)? ا([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ل([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)? ع([ًٌٍَُِّْ]+)?ن([ًٌٍَُِّْ]+)?ه([ًٌٍَُِّْ]+)?م([ًٌٍَُِّْ]+)?/g, 'ﭫ')

        return processedText
    }

}