<details class="bg-slate-300 rounded">
    <slot />

    <summary>نص محسَّن</summary>

    <br />

    <div class="max-w-prose mx-auto my-0">
        <br />

        <p>مثال للتجربة:</p>
        <p>
            قال رسول اللَِّهِ صلَّى اللهُ عَليهِ وسلَّمَ: (قال اللهُ عزَّ وجل:
            (( من آذى لي وليا فقد بارزني بالحرب ))) . وهو من أحاديث - بل من أشهر
            أحاديث - "القوم" رضِي الله عنهم ؛ قال الله جل جلاله : {"{"}لا خوف
            عليهم ولا هم يحزنون{"}"}
        </p>

        <br />

        <p>حاليا، فيه التعديلات الآتية:</p>
        <ol class="text-right p-lg list-decimal list-inside">
            <br />
            <p>رمز التسبيح والدعاء:</p>
            <li>
                حذف التشكيل الزائد ـ يعني ليس الإعراب ـ من اسم الجلالة
                (اَلْلَّه) إلى (الله) - لكي لا يؤثر في الخط
            </li>
            <li>
                تحويل التسبيح (عز وجل) ـ بغض النظر عن تشكيله ـ إلى رمزه (۵)، حسب
                الخط «أضواء السلف»
            </li>
            <li>
                تحويل التسبيح (جل جلاله) ـ بغض النظر عن تشكيله ـ إلى رمزه (ﷻ)
            </li>
            <li>
                تحويل الدعاء (صلى الله عليه وسلم) ـ بغض النظر عن تشكيله ـ إلى
                رمزه (ﷺ)
            </li>
            <li>
                تحويل الدعاء (عليه السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه (ڠ)،
                حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (عليها السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ﮋ)، حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (عليهما السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ڽ)، حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (عليهم السلام) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ۏ)، حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (رضي الله عنه) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ﭬ)، حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (رضي الله عنها) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ڤ)، حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (رضي الله عنهما) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ﭭ)، حسب الخط «أضواء السلف»
            </li>
            <li>
                تحويل الدعاء (رضي الله عنهم) ـ بغض النظر عن تشكيله ـ إلى رمزه
                (ﭫ)، حسب الخط «أضواء السلف»
            </li>

            <br />
            <p>تصحيح التشكيل والترقيم:</p>
            <li>نقل تنوين فتحة من الألف إلى قبلها: (باباً) إلى (بابًا)</li>
            <li>حذف الفتحة قبل تاء مربوطة: (قطَة) إلى (قطة)</li>
            <li>حذف الألف قبل ألف مد: (بَاب) إلى (باب)</li>
            <li>حذف سكون الألف المدية: (باْبٌ) إلى (بابٌ)</li>
            <li>حذف سكون الواو المدية: (طُوْل) إلى (طُول)</li>
            <li>حذف سكون الياء المدية: (قِيْل) إلى (قِيل)</li>
            <li>نقل الشدة قبل الحركة على نفس الحرف</li>
            <li>حذف المسافة الزائدة قبل علامات الترقيم (، ؛ : .)</li>
            <li>
                حذف المسافة في أول وآخر القوس والتنصيص: (« باب ») إلى («باب»)
            </li>
            <li>تحويل القوس المعوج إلى قوس قرآني: ({"{"}{"}"}) إلى (﴿﴾)</li>
            <li>
                تحويل التنصيص الإنجليزي إلى العربي: (باب "باب".) إلى (باب
                «باب».)
            </li>
            <li>
                تحويل القوس العادي إلى قوسين التنصيص: (باب ((باب)).) إلى (باب
                «باب».)
            </li>
            <li>
                تحويل الشرطة إلى الكشيدة: (باب - باب - باب) إلى (باب ـ باب ـ
                باب)
            </li>
            <li>حذف الكشيدة أي التطويل في أثناء الكلمات: (مـن) إلى (من)</li>
            <br />
            <p>اقتراحات للمستقبل إن شاء الله:</p>
            <li>تشكيل مطلوب لكلمات متكررة سوى حركة الإعراب، أو لجامدات</li>
            حذف الحركات (فِيْ)
            <li>آلية اختيار التعديلات المطلوبة فقط</li>

            <p>أفكار متروكة:</p>
            <li>تحويل الأرقام الإنجليزية (123...) إلى العربية (١٢٣...) - لأن هذا يشوش مع الوورد</li>
        </ol>
    </div>
</details>

<style>
    p,
    li {
        font-size: larger;
    }
</style>
