<details class="rounded-xl border border-sky-600">
    <slot />

    <summary class="font-bold text-sky-600">النص المحسَّن</summary>

    <br />

    <div class="max-w-prose mx-auto my-0">
        <br />

        <p>مثال للتجربة:</p>
        <p>
            قال رسول اللَِّهِ صلَّى اللهُ عَليهِ وسلَّمَ: (قال اللهُ عزَّ وجل:
            (( من آذى لي وليا فقد بارزني بالحرب ))) . وهو من أحاديث - بل من أشهر
            أحاديث - "الْقوم" رضِي الله عنهم ؛ قال الله جل جلاله : {"{"}لا خوف
            عليهم ولا هم يحزنون{"}"}
        </p>

        <br />

        <p>حاليا، فيه التعديلات الآتية:</p>
        <ol class="text-right p-lg list-decimal list-inside">
            <p>تصحيح التشكيل والترقيم:</p>
            <li>
                حذف التشكيل الزائد والشدة نهائياً من (الله) مع الإبقاء على حركة
                الإعراب فقط على الهاء
            </li>
            <li>
                تحويل الدعاء (صلى الله عليه وسلم) ـ بغض النظر عن تشكيله ـ إلى
                رمزه (ﷺ)
            </li>
            <li>
                حذف التشكيل الزائد والشدة من (لله) مع الإبقاء على حركة الإعراب
                وتجنب الكلمات المشابهة (مثل: يحلله)
            </li>
            <li>نقل تنوين فتحة ليكون على الألف وليس قبلها: (بابًا) إلى (باباً)</li>
            <li>حذف الفتحة قبل تاء مربوطة: (قطَة) إلى (قطة)</li>
            <li>حذف الفتحة قبل ألف مد: (بَاب) إلى (باب)</li>
            <li>حذف سكون الألف المدية: (باْبٌ) إلى (بابٌ)</li>
            <li>حذف سكون الواو المدية: (طُوْل) إلى (طُول)</li>
            <li>حذف سكون الياء المدية: (قِيْل) إلى (قِيل)</li>
            <li>نقل الشدة قبل الحركة على نفس الحرف</li>
            <li>حذف سكون لام التعريف: (الْكتاب) إلى (الكتاب)</li>
            <li>حذف المسافة الزائدة قبل علامات الترقيم (، ؛ : .)</li>
            <li>
                حذف المسافة في أول وآخر القوس والتنصيص: (« باب ») إلى («باب»)
            </li>
            <li>تحويل القوس المعوج إلى قوس قرآني: ({"{"}{"}"}) إلى (﴿﴾)</li>
            <li>
                تحويل التنصيص الإنجليزي إلى العربي: (باب "باب".) إلى (باب
                «باب».)
            </li>
            <li>
                تحويل القوس العادي إلى قوص التنصيص: (باب ((باب)).) إلى (باب
                «باب».)
            </li>
            <li>
                تحويل القوس الحاد إلى قوس التنصيص: ({"<"}باب{">"}) إلى («باب»)
            </li>
            <li>
                تحويل الشرطة إلى الكشيدة: (باب - باب - باب) إلى (باب ـ باب ـ
                باب)
            </li>
            <li>حذف الكشيدة أي التطويل في أثناء الكلمات: (مـن) إلى (من)</li>
            <li>
                حذف الفواصل غير المرئية (ZWNJ) لمنع تقطع الحروف والحركات
                المتصلة: (أفعال‌ه) إلى (أفعاله)
            </li>
        </ol>

        <br />

        <ol class="text-right p-lg list-decimal list-inside">
            <p>اقتراحات للمستقبل إن شاء الله:</p>
            <li>تشكيل مطلوب لكلمات متكررة سوى حركة الإعراب، أو لجامدات</li>
            حذف الحركات (فِيْ)
            <li>آلية اختيار التعديلات المطلوبة فقط</li>

            <p>أفكار متروكة:</p>
            <li>
                تحويل الأرقام الإنجليزية (123...) إلى العربية (١٢٣...) - لأن هذا
                يشوش مع الوورد
            </li>
        </ol>
    </div>
</details>

<style>
    p,
    li {
        font-size: larger;
    }
</style>
