<details class="bg-slate-300 rounded ">
    <summary>كيفية تحسين النص</summary>
    <p>حاليا، فيه التعديلات الآتية:</p>
    <ol class="text-right p-lg list-decimal list-inside">
        <li>حذف الفتحة قبل تاء مربوطة: (قطَة) إلى (قطة)</li>
        <li>حذف الألف قبل ألف مد: (بَاب) إلى (باب)</li>
        <li>نقل تنوين فتحة من الألف إلى قبلها: (باباً) إلى (بابًا)</li>
        <li>حذف سكون الألف المدية: (باْبٌ) إلى (بابٌ)</li>
        <li>حذف سكون الواو المدية: (طُوْل) إلى (طُول)</li>
        <li>حذف سكون الياء المدية: (قِيْل) إلى (قِيل)</li>
        <li>نقل الشدة قبل الحركة على نفس الحرف</li>
        <li>تحويل القوس المعوج إلى قوس قرآني: ({"{"}{"}"}) إلى (﴿﴾)</li>
        <li>حذف المسافة قبل علامات الترقيم (، ؛ : .)</li>
        <li>حذف المسافة في أول وآخر القوس والتنصيص: (« باب ») إلى («باب»)</li>
        <li>
            تحويل الشرطة إلى الكشيدة: (باب - باب - باب) إلى (باب ـ باب ـ باب)
        </li>
<br>
        اقتراحات للمستقبل إن شاء الله:
        <li>تشكيل مطلوب لكلمات متكررة سوى حركة الإعراب، أو لجامدات</li>
        حذف الحركات (فِيْ)
        <li>تحويل الأدعية إلى الرموز</li>
    </ol>

    <br>

    مثال للتجربة:
    <p>بَوَّابَةٌ إِلَى عَاْلَمِيْنَ - بِدُوْنِ مَيْنٍ - {"{"}لِمَنْ كَاْنَ{"}"} فَتَحَ بَاْباً مِنَ السَّمَاْءِ . اِسْمُهُ : « الكُوْ » ، ( وَالفُوْ )</p>
</details>
